In [1]:
from pathlib import Path
import os
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data_folder = Path("../../data")
os.listdir(data_folder)

['00.ghichu.txt',
 '00_dhcntt-dtdh_19-01-2016_scan.pdf',
 '01.sinhvien.xlsx',
 '02.diem.xlsx',
 '03.sinhvien_chungchi.xlsx',
 '04.xeploaiav.xlsx',
 '05.ThiSinh.xlsx',
 '06.giayxacnhan.xlsx',
 '08.XLHV.xlsx',
 '10.diemrl.xlsx',
 '12.baoluu.xlsx',
 '14.totnghiep.xlsx',
 'diemrl.xlsx',
 'diem_Thu.xlsx',
 'Education_dataset_V2.rar',
 'sinhvien_dtb_hocky.xlsx',
 'sinhvien_dtb_toankhoa.xlsx',
 'uit_hocphi_miengiam.xlsx']

In [3]:
data_stem = 'diemrl'
old_df = pd.read_excel(data_folder/f"{data_stem}.xlsx")
new_df = old_df.copy(deep = True)

In [4]:
new_df.sample(3)

,id,mssv,lopsh,hocky,namhoc,drl,ghichu
16919,50173,D8B81312XPvAibaEXe/PGAaNNWvbUIfmRv3bR2wn,HTTT2013,2,2015,64,NaN
65787,111828,B0C7AB81XPvAibaEXe+Bn/Kbq8h84PR7K1SVKA8p,PMCL2019,1,2019,100,NaN
42283,88320,D4FF429DXPvAibaEXe/r5MZmMPRuFQFzV1VHdDY3,CNPM04,2,2010,91,NaN

In [5]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      111978 non-null  int64
 1   mssv    111978 non-null  object
 2   lopsh   101450 non-null  object
 3   hocky   111978 non-null  int64
 4   namhoc  111978 non-null  int64
 5   drl     111978 non-null  int64
 6   ghichu  14768 non-null   object
dtypes: int64(4), object(3)
memory usage: 6.0+ MB

In [6]:
old_primary_key = ['mssv', 'namhoc', 'hocky']
new_primary_key = ['mssv', 'nam_hoc', 'hoc_ky']

In [7]:
old_df.columns

Index(['id', 'mssv', 'lopsh', 'hocky', 'namhoc', 'drl', 'ghichu'], dtype='object')

In [8]:
new_df.columns = ['id', 'mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'ghi_chu']

In [9]:
new_df.describe()

                  id         hoc_ky        nam_hoc            drl
count  111978.000000  111978.000000  111978.000000  111978.000000
mean    99981.614237       1.455732    2016.920475      76.642823
std     45135.101576       0.498039       3.681945      19.433861
min         1.000000       1.000000    2009.000000     -45.000000
25%     65004.250000       1.000000    2014.000000      66.000000
50%    102029.500000       1.000000    2018.000000      79.000000
75%    136927.750000       2.000000    2020.000000      90.000000
max    178976.000000       2.000000    2022.000000     122.000000

In [10]:
new_df.drop('id', axis=1, inplace=True)

In [11]:
for col in new_primary_key:
    print(new_df[new_df[col].isnull()])

Empty DataFrame
Columns: [mssv, lop_sh, hoc_ky, nam_hoc, drl, ghi_chu]
Index: []
Empty DataFrame
Columns: [mssv, lop_sh, hoc_ky, nam_hoc, drl, ghi_chu]
Index: []
Empty DataFrame
Columns: [mssv, lop_sh, hoc_ky, nam_hoc, drl, ghi_chu]
Index: []

In [12]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 6 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     111978 non-null  object
 1   lop_sh   101450 non-null  object
 2   hoc_ky   111978 non-null  int64
 3   nam_hoc  111978 non-null  int64
 4   drl      111978 non-null  int64
 5   ghi_chu  14768 non-null   object
dtypes: int64(3), object(3)
memory usage: 5.1+ MB

# mssv

In [13]:
new_df.mssv.value_counts(dropna=False)

mssv
030FC1CFXPvAibaEXe+9lRniSKKSh3iBkTOiNqQs    14
7075BE69XPvAibaEXe8WdGcsQTF3yHQhmzrDl1Yc    14
6F2995F1XPvAibaEXe88UewilValgL4Zqtgm5Ap0    14
3C303D57XPvAibaEXe/nRR7q+hWy3Opqpurh7Okn    14
A4EEB45EXPvAibaEXe+wmtNhlfgIwjN3iuw7Uj8E    14
                                            ..
8644B1B1XPvAibaEXe8i5/EyPLsCjZfcFZVEv65r     1
ED9A5CEEXPvAibaEXe91/NKp9te382uALbdrfaJC     1
5E9FBE1EXPvAibaEXe8dy+jFD2oQpRHzHdc3CFXD     1
8B6AA6ABXPvAibaEXe/ZgviRw0Hz8UJbsBNdAhWX     1
2F3C5091XPvAibaEXe+sfYgLIH7gOxzJxMJIBXzw     1
Name: count, Length: 17982, dtype: int64

In [14]:
new_df.mssv.isnull().sum()

0

In [15]:
new_df.mssv = new_df.mssv.str.strip()

In [16]:
new_df.mssv.str.len().value_counts(dropna=False)

mssv
40    111978
Name: count, dtype: int64

# lop_sh

In [17]:
new_df.columns

Index(['mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'ghi_chu'], dtype='object')

In [18]:
new_df.lop_sh.value_counts(dropna=False)

lop_sh
NaN           10528
CNPM04         1644
MMT04          1608
KTPM0001       1516
HTTT0001       1448
              ...
KHCl2019          5
CNTN05            4
AEP01             3
CNCL2021.2        1
AEPP01            1
Name: count, Length: 239, dtype: int64

In [19]:
new_df.lop_sh.isnull().sum()

10528

In [20]:
new_df.lop_sh = new_df.lop_sh.str.upper().str.strip()

In [21]:
new_df.lop_sh.str.len().value_counts(dropna=False)

lop_sh
8.0     90458
NaN     10528
6.0      8248
5.0      2670
10.0       74
Name: count, dtype: int64

# hoc_ky

In [22]:
new_df.columns

Index(['mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'ghi_chu'], dtype='object')

In [23]:
new_df.hoc_ky.value_counts(dropna=False)

hoc_ky
1    60946
2    51032
Name: count, dtype: int64

In [24]:
new_df.hoc_ky.isnull().sum()

0

# nam_hoc

In [25]:
new_df.columns

Index(['mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'ghi_chu'], dtype='object')

In [26]:
new_df.nam_hoc.value_counts(dropna=False)

nam_hoc
2021    14354
2020    13150
2019    11687
2018    10070
2017     9133
2022     7896
2016     7869
2015     7485
2012     6504
2014     6139
2011     5590
2013     5549
2009     3319
2010     3233
Name: count, dtype: int64

In [27]:
new_df.nam_hoc.isnull().sum()

0

# drl

In [28]:
new_df.columns

Index(['mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'ghi_chu'], dtype='object')

In [29]:
new_df.drl.value_counts(dropna=False)

drl
 100    16568
 90      5506
 80      4620
 75      3982
 85      3500
        ...
-39         1
-37         1
-43         1
-29         1
-31         1
Name: count, Length: 144, dtype: int64

In [30]:
new_df.drl.isnull().sum()

0

In [31]:
new_df.drl.describe()

count    111978.000000
mean         76.642823
std          19.433861
min         -45.000000
25%          66.000000
50%          79.000000
75%          90.000000
max         122.000000
Name: drl, dtype: float64

In [32]:
(new_df.drl < 0).sum()

172

In [33]:
new_df[new_df.drl < 0].drl.describe()

count    172.000000
mean     -15.924419
std       11.848463
min      -45.000000
25%      -25.000000
50%      -12.000000
75%       -5.000000
max       -1.000000
Name: drl, dtype: float64

In [34]:
new_df.drl[new_df.drl < 0] *= -1

C:\Users\vuhh2\AppData\Local\Temp\ipykernel_14180\4079900021.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.drl[new_df.drl < 0] *= -1

# ghi_chu

In [35]:
new_df.columns

Index(['mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'ghi_chu'], dtype='object')

In [36]:
new_df.ghi_chu.value_counts(dropna=False)

ghi_chu
NaN           97210
Xuất sắc       3669
Khá            1491
Tốt            1432
Trung bình     1259
              ...
ATTN2016          7
KHTN2016          7
KHCl2019.3        1
KHCL2020          1
KHMT2016          1
Name: count, Length: 143, dtype: int64

In [37]:
new_df.ghi_chu.isnull().sum()

97210

In [38]:
new_df.ghi_chu = new_df.ghi_chu.str.upper().str.strip()

In [39]:
tmp = new_df.ghi_chu.value_counts(dropna=False)
print(tmp.to_markdown())

| ghi_chu    |   count |
|:-----------|--------:|
| nan        |   97210 |
| XUẤT SẮC   |    3669 |
| KHÁ        |    1491 |
| TỐT        |    1432 |
| TRUNG BÌNH |    1259 |
| CNTT2018   |     134 |
| HTTT0001   |     130 |
| KTPM0001   |     121 |
| CNTT2019   |     119 |
| KHMT2019   |     115 |
| KTMT0001   |     108 |
| MMTT0001   |     108 |
| KTPM2019   |     103 |
| KTPM2020   |      98 |
| HTCL2020   |      98 |
| HTTT2017   |      95 |
| MMCL2020   |      91 |
| KTPM2018   |      90 |
| ATCL2020   |      89 |
| CNTT2017   |      87 |
| CNTT2020   |      87 |
| KTMT2019   |      81 |
| ATTT2020   |      80 |
| HTTT2019   |      79 |
| MMTT2016   |      79 |
| MMTT2019   |      78 |
| MMTT2020   |      76 |
| KTPM2017   |      73 |
| TMĐT2018   |      71 |
| HTTT2020   |      71 |
| KHMT2018   |      71 |
| MMTT2017   |      70 |
| KTPM2016   |      70 |
| CNCL2020.1 |      70 |
| KHDL2020   |      69 |
| KHMT2020   |      69 |
| CNCL2020.2 |      68 |
| TMĐT2017   |      67 |
| HTTT2018   |      66 |
| CNTT2016   |      65 |
| KHCL2020.2 |      64 |
| MMTT2018   |      62 |
| PMCL2020.2 |      61 |
| KHCL2020.1 |      60 |
| CTTT2020   |      59 |
| KTMT2016   |      59 |
| MTCL2020.2 |      58 |
| HTTT2016   |      58 |
| ATTT2017   |      58 |
| ATTT2019   |      58 |
| PMCL2020.1 |      57 |
| MTCL2020.1 |      57 |
| TMCL2020   |      57 |
| KHDL2019   |      56 |
| KHDL2018   |      56 |
| KTMT2020   |      53 |
| KTMT2018   |      53 |
| ATTT2016   |      53 |
| TMĐT2020   |      51 |
| KHMT2016.2 |      49 |
| TMĐT2019   |      49 |
| ATTT2018   |      49 |
| MMCL2019.2 |      48 |
| MMCL2019.1 |      47 |
| KHCL2019.3 |      46 |
| CTTT2018   |      46 |
| PMCL2019.1 |      45 |
| YẾU        |      45 |
| PMCL2018.1 |      44 |
| PMCL2019.2 |      44 |
| PMCL2019.3 |      44 |
| PMCL2018.2 |      44 |
| PMCL2017.1 |      43 |
| KHCL2019.2 |      42 |
| PMCL2017.2 |      42 |
| CNCL2019.2 |      42 |
| ATCL2017   |      41 |
| PMCL2017.3 |      41 |
| KTMT2017   |      41 |
| ATCL2019.1 |      41 |
| KHMT0001   |      41 |
| TMĐT2016   |      41 |
| KHCL2019.1 |      40 |
| KHMT2017   |      40 |
| ATCL2019.2 |      39 |
| HTCL2019.2 |      39 |
| HTCL2019.1 |      38 |
| CNCL2018.1 |      38 |
| KHCL2018.1 |      38 |
| CNCL2019.3 |      38 |
| TMCL2019.2 |      37 |
| KHCL2018.3 |      37 |
| CTTT2019.2 |      37 |
| CNCL2019.1 |      37 |
| HTCL2018.2 |      36 |
| HTCL2018.1 |      36 |
| KHCL2018.2 |      36 |
| PMCL2016.1 |      36 |
| TMCL2019.1 |      35 |
| PMCL2016.2 |      35 |
| MTCL2019.3 |      35 |
| CNTT0001   |      35 |
| KHMT2016.1 |      35 |
| CTTT2019.1 |      34 |
| MTCL2019.1 |      34 |
| MMCL2018.1 |      33 |
| HTCL2017.1 |      33 |
| MTIO2020   |      33 |
| CNCL2018.2 |      33 |
| CTTT2016   |      32 |
| PMCL2016.3 |      32 |
| KHNT2020   |      32 |
| MTCL2019.2 |      31 |
| KHTN2019   |      31 |
| HTCL2017.2 |      31 |
| ATCL2018.1 |      31 |
| ATCL2018.2 |      30 |
| MTCL2018.3 |      29 |
| MTCL2018.1 |      29 |
| MTCL2018.2 |      28 |
| MTCL2017.1 |      28 |
| MMCL2017   |      28 |
| HTCL2016.2 |      27 |
| MTCL2017.2 |      27 |
| ATTN2019   |      26 |
| KHTN2018   |      26 |
| HTCL2016.1 |      26 |
| MMCL2018.2 |      26 |
| ATTN2018   |      26 |
| CTTT2017   |      25 |
| MTCL2016.2 |      25 |
| KHTN2020   |      25 |
| MTCL2016.1 |      23 |
| KHCL2017.2 |      21 |
| KHTN2017   |      21 |
| ATTN2017   |      21 |
| ATTN2020   |      19 |
| KHCL2017.1 |      17 |
| KHTN2016   |       7 |
| ATTN2016   |       7 |
| KHMT2016   |       1 |
| KHCL2020   |       1 |

In [40]:
new_df.ghi_chu.str.len().value_counts(dropna=False)

ghi_chu
NaN     97210
8.0      8054
10.0     3746
3.0      2968
Name: count, dtype: int64

# lop_sh and ghi_chu

In [41]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 6 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     111978 non-null  object
 1   lop_sh   101450 non-null  object
 2   hoc_ky   111978 non-null  int64
 3   nam_hoc  111978 non-null  int64
 4   drl      111978 non-null  int64
 5   ghi_chu  14768 non-null   object
dtypes: int64(3), object(3)
memory usage: 5.1+ MB

In [42]:
tmp = new_df.loc[new_df.ghi_chu.notnull(), ['lop_sh', 'ghi_chu']].drop_duplicates()
# print(tmp.to_markdown())
tmp

          lop_sh     ghi_chu
76578   ATCL2017    ATCL2017
76619   ATCL2018  ATCL2018.1
76650   ATCL2018  ATCL2018.2
76680   ATCL2019  ATCL2019.1
76721   ATCL2019  ATCL2019.2
...          ...         ...
110901  KHDL2022         KHÁ
111018  MTIO2022  TRUNG BÌNH
111561  KHNT2022         KHÁ
111614  HTTT2022  TRUNG BÌNH
111666  CTTT2022  TRUNG BÌNH

[481 rows x 2 columns]

In [43]:
tmp = new_df.loc[new_df.ghi_chu.notnull() & new_df.lop_sh.isnull(), ['lop_sh', 'ghi_chu']].drop_duplicates()
# print(tmp.to_markdown())
tmp

Empty DataFrame
Columns: [lop_sh, ghi_chu]
Index: []

In [44]:
tmp = new_df.loc[new_df.ghi_chu == new_df.lop_sh, ['lop_sh', 'ghi_chu']].drop_duplicates()
# print(tmp.to_markdown())
tmp

         lop_sh   ghi_chu
76578  ATCL2017  ATCL2017
76760  ATCL2020  ATCL2020
76849  ATTN2016  ATTN2016
76856  ATTN2017  ATTN2017
76877  ATTN2018  ATTN2018
...         ...       ...
83171  TMĐT2016  TMĐT2016
83212  TMĐT2017  TMĐT2017
83279  TMĐT2018  TMĐT2018
83350  TMĐT2019  TMĐT2019
83399  TMĐT2020  TMĐT2020

[72 rows x 2 columns]

In [45]:
tmp = new_df.loc[new_df.lop_sh.isnull(), ['lop_sh', 'ghi_chu']].drop_duplicates()
# print(tmp.to_markdown())
tmp

     lop_sh ghi_chu
1402    NaN     NaN

In [46]:
tmp = new_df.loc[new_df.lop_sh.isnull(), ['lop_sh', 'ghi_chu']]
tmp.shape[0]

10528

In [47]:
new_df.columns

Index(['mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'ghi_chu'], dtype='object')

In [48]:
tmp_list = ['TRUNG BÌNH', 'KHÁ', 'TỐT', 'XUẤT SẮC', 'YẾU']
def tmp_filter(row):
    return not pd.isnull(row.ghi_chu) \
        and not str(row.ghi_chu).startswith(str(row.lop_sh)) \
        and row.ghi_chu not in tmp_list

tmp = new_df.loc[new_df.apply(tmp_filter, axis=1), ['lop_sh', 'ghi_chu']].drop_duplicates()
# print(tmp.to_markdown())
tmp

Empty DataFrame
Columns: [lop_sh, ghi_chu]
Index: []

In [49]:
new_df.rename(columns={'ghi_chu': 'lop_sh_cu_the'}, inplace=True)
new_df.columns

Index(['mssv', 'lop_sh', 'hoc_ky', 'nam_hoc', 'drl', 'lop_sh_cu_the'], dtype='object')

In [50]:
tmp_list = ['TRUNG BÌNH', 'KHÁ', 'TỐT', 'XUẤT SẮC', 'YẾU']
mapping_list = {a: None for a in tmp_list}
new_df.lop_sh_cu_the = new_df.lop_sh_cu_the.replace(tmp_list).fillna(new_df.lop_sh)
mapping_list

{'TRUNG BÌNH': None, 'KHÁ': None, 'TỐT': None, 'XUẤT SẮC': None, 'YẾU': None}

In [51]:
new_df[['lop_sh', 'lop_sh_cu_the']].sample(3)

         lop_sh lop_sh_cu_the
3657   KTPM2012      KTPM2012
17928  KTPM2013      KTPM2013
51713  KTPM2014      KTPM2014

In [52]:
new_df.lop_sh_cu_the.fillna('NULL', inplace=True)
new_df.lop_sh.fillna('NULL', inplace=True)

In [53]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   mssv           111978 non-null  object
 1   lop_sh         111978 non-null  object
 2   hoc_ky         111978 non-null  int64
 3   nam_hoc        111978 non-null  int64
 4   drl            111978 non-null  int64
 5   lop_sh_cu_the  111978 non-null  object
dtypes: int64(3), object(3)
memory usage: 5.1+ MB

# data type

In [54]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   mssv           111978 non-null  object
 1   lop_sh         111978 non-null  object
 2   hoc_ky         111978 non-null  int64
 3   nam_hoc        111978 non-null  int64
 4   drl            111978 non-null  int64
 5   lop_sh_cu_the  111978 non-null  object
dtypes: int64(3), object(3)
memory usage: 5.1+ MB

In [55]:
tmp = new_df.hoc_ky.unique().tolist()
mapping_dict = {a:str(a) for a in tmp}
new_df.hoc_ky = new_df.hoc_ky.map(mapping_dict)
mapping_dict

{2: '2', 1: '1'}

In [56]:
tmp = new_df.nam_hoc.unique().tolist()
mapping_dict = {a:str(a) for a in tmp}
new_df.nam_hoc = new_df.nam_hoc.map(mapping_dict)
mapping_dict

{2013: '2013',
 2014: '2014',
 2015: '2015',
 2011: '2011',
 2016: '2016',
 2012: '2012',
 2009: '2009',
 2010: '2010',
 2017: '2017',
 2018: '2018',
 2019: '2019',
 2020: '2020',
 2021: '2021',
 2022: '2022'}

In [57]:
new_df.mssv = new_df.mssv.astype('category')
new_df.lop_sh = new_df.lop_sh.astype('category')
new_df.lop_sh_cu_the = new_df.lop_sh_cu_the.astype('category')
new_df.hoc_ky = new_df.hoc_ky.astype('category')
new_df.nam_hoc = new_df.nam_hoc.astype('category')
new_df.drl = new_df.drl.astype('int16')
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   mssv           111978 non-null  category
 1   lop_sh         111978 non-null  category
 2   hoc_ky         111978 non-null  category
 3   nam_hoc        111978 non-null  category
 4   drl            111978 non-null  int16
 5   lop_sh_cu_the  111978 non-null  category
dtypes: category(5), int16(1)
memory usage: 1.7 MB

# final check

In [58]:
new_df[new_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [mssv, lop_sh, hoc_ky, nam_hoc, drl, lop_sh_cu_the]
Index: []

In [59]:
new_df.duplicated().sum()

0

In [60]:
new_df[new_primary_key].duplicated().sum()

0

In [61]:
new_df.describe()

                 drl
count  111978.000000
mean       76.691743
std        19.239898
min         0.000000
25%        66.000000
50%        79.000000
75%        90.000000
max       122.000000

In [62]:
new_df.mssv.value_counts(dropna=False)

mssv
7ACF155CXPvAibaEXe/m6K07u0dn96OeUHTRay32    14
A04A5CCEXPvAibaEXe+9WAygB66RlF4HE3xKTe4q    14
E0B02E8EXPvAibaEXe8FWWF7xHXRAAavJy7+pwwV    14
517F0E78XPvAibaEXe/ETkXgDMKQ8UD1PP6Mi8BH    14
29C09889XPvAibaEXe8dZIB3odxynhtkSv0G/qxR    14
                                            ..
92EC13F7XPvAibaEXe/rTDu3MA2WPTJ79lg0gkVX     1
92EB4340XPvAibaEXe9rVBbTe7KJuniPPZ+6BVZu     1
B386CB8BXPvAibaEXe+GOOKyXJMTZgA9Vwf9hyrg     1
C91FE431XPvAibaEXe/pnXUIwMJHJmEhadHhr1OM     1
28CF250BXPvAibaEXe/6PnY50QDPtoWBX03DJpGu     1
Name: count, Length: 17982, dtype: int64

In [63]:
new_df.lop_sh.value_counts(dropna=False)

lop_sh
NULL          10528
CNPM04         1644
MMT04          1608
KTPM0001       1516
HTTT0001       1448
              ...
MTLK2015         12
CNTN05            4
AEP01             3
CNCL2021.2        1
AEPP01            1
Name: count, Length: 237, dtype: int64

In [64]:
new_df.hoc_ky.value_counts(dropna=False)

hoc_ky
1    60946
2    51032
Name: count, dtype: int64

In [65]:
new_df.nam_hoc.value_counts(dropna=False)

nam_hoc
2021    14354
2020    13150
2019    11687
2018    10070
2017     9133
2022     7896
2016     7869
2015     7485
2012     6504
2014     6139
2011     5590
2013     5549
2009     3319
2010     3233
Name: count, dtype: int64

In [66]:
new_df.drl.value_counts(dropna=False)

drl
100    16568
90      5506
80      4620
75      3982
85      3500
       ...
6         17
3         17
9         15
11        13
122        2
Name: count, Length: 102, dtype: int64

In [67]:
new_df.lop_sh_cu_the.value_counts(dropna=False)

lop_sh_cu_the
NULL          10528
CNPM04         1644
MMT04          1608
KTPM0001       1516
HTTT0001       1448
              ...
MTLK2015         12
CNTN05            4
AEP01             3
CNCL2021.2        1
AEPP01            1
Name: count, Length: 299, dtype: int64

# save

In [68]:
clean_data_folder = Path("../clean_data")
new_df.to_parquet(clean_data_folder/f"{data_stem}.parquet", index=False)
haha_df = pd.read_parquet(clean_data_folder/f"{data_stem}.parquet")

In [69]:
old_df[old_df.isnull().any(axis=1)]

,id,mssv,lopsh,hocky,namhoc,drl,ghichu
0,1,2A10C466XPvAibaEXe8vcQUX+A6FeNIl5Loug1zV,ANTN2012,2,2013,81,NaN
1,2,903ADF1AXPvAibaEXe9p5G9u2qRxxZEjiJjD4Ztl,ANTN2012,2,2013,88,NaN
2,3,F06EDFFEXPvAibaEXe8KSegZW1rFPMNPBQ+c9rst,ANTN2012,2,2013,94,NaN
3,4,AA868AD5XPvAibaEXe+1Gm1QkI5oNyTYwjwmgxhx,ANTN2012,2,2013,86,NaN
4,5,E7105148XPvAibaEXe+E7LJdSZ9AW2sUcg4OSCnU,ANTN2012,2,2013,88,NaN
...,...,...,...,...,...,...,...
104077,171068,AA1C2CB0XPvAibaEXe+gzQv7yQRYbtqPu+C2Ean+,PMCL2018,2,2021,84,NaN
104078,171071,C5B47790XPvAibaEXe8XtTI6VHhlKI0qhA2KfoCe,PMCL2018,2,2021,85,NaN
104079,171074,4BD52092XPvAibaEXe/sKOWIYAkjtqMmin54+S4E,PMCL2018,2,2021,97,NaN
104080,171077,C50FB698XPvAibaEXe+9v37KcInSIff/FxEfaYpI,PMCL2018,2,2021,96,NaN
104081,171080,C652408CXPvAibaEXe/baiw3K4HkF5HM+yiC7grI,KTPM0001,2,2021,70,NaN

In [70]:
haha_df[haha_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [mssv, lop_sh, hoc_ky, nam_hoc, drl, lop_sh_cu_the]
Index: []

In [71]:
old_df[old_primary_key].duplicated().sum()

0

In [72]:
haha_df[new_primary_key].duplicated().sum()

0

In [73]:
old_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      111978 non-null  int64
 1   mssv    111978 non-null  object
 2   lopsh   101450 non-null  object
 3   hocky   111978 non-null  int64
 4   namhoc  111978 non-null  int64
 5   drl     111978 non-null  int64
 6   ghichu  14768 non-null   object
dtypes: int64(4), object(3)
memory usage: 6.0+ MB

In [74]:
haha_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111978 entries, 0 to 111977
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   mssv           111978 non-null  category
 1   lop_sh         111978 non-null  category
 2   hoc_ky         111978 non-null  category
 3   nam_hoc        111978 non-null  category
 4   drl            111978 non-null  int16
 5   lop_sh_cu_the  111978 non-null  category
dtypes: category(5), int16(1)
memory usage: 1.7 MB

In [75]:
old_df.describe()

                  id          hocky         namhoc            drl
count  111978.000000  111978.000000  111978.000000  111978.000000
mean    99981.614237       1.455732    2016.920475      76.642823
std     45135.101576       0.498039       3.681945      19.433861
min         1.000000       1.000000    2009.000000     -45.000000
25%     65004.250000       1.000000    2014.000000      66.000000
50%    102029.500000       1.000000    2018.000000      79.000000
75%    136927.750000       2.000000    2020.000000      90.000000
max    178976.000000       2.000000    2022.000000     122.000000

In [76]:
haha_df.describe()

                 drl
count  111978.000000
mean       76.691743
std        19.239898
min         0.000000
25%        66.000000
50%        79.000000
75%        90.000000
max       122.000000

In [77]:
old_df.sample(5)

,id,mssv,lopsh,hocky,namhoc,drl,ghichu
26265,63275,7E048679XPvAibaEXe/Eu1NFTIhfjOAHeYP3maj2,NaN,2,2012,77,NaN
33588,74769,6804DC20XPvAibaEXe9dKITjhF3qTSqJgqvgUdJ2,CNTT2015,2,2016,83,NaN
67872,113913,7CD02A9FXPvAibaEXe+g4B5cywZjwcj8TsG91YaQ,CNTT2019,1,2019,87,NaN
73822,119863,CFF9BC4DXPvAibaEXe85qP6RA1Xpqn7fDxRekifE,ATTN2018,2,2019,83,NaN
69404,115445,1ED6A4F0XPvAibaEXe99J3nD1pBZIhGQiopf02P5,MTCL2015,1,2019,74,NaN

In [78]:
haha_df.sample(10)

,mssv,lop_sh,hoc_ky,nam_hoc,drl,lop_sh_cu_the
28964,EEE8133AXPvAibaEXe/fr6IbK8XJMpydcQI3h+jS,NULL,2,2011,72,NULL
40133,279A7389XPvAibaEXe/WaZKSSjfnhiAxIlEt0pqi,KTMT04,2,2009,0,KTMT04
107945,66E0FD89XPvAibaEXe+UUQWJxakK0qTxD5JlVtOO,HTCL2020,1,2022,84,HTCL2020
72554,0356BA29XPvAibaEXe/i44g6992J04DlKo1DQNSP,HTTT2019,2,2019,90,HTTT2019
62734,9E07C94FXPvAibaEXe8zjuWfAVBr9dkwL6dLCwH6,PMCL2016,2,2018,75,PMCL2016
17455,45D3737EXPvAibaEXe+CejwL/H7GKPIwo9ansi/m,KTMT2012,2,2015,90,KTMT2012
102913,70AC0FBBXPvAibaEXe+6333OdPqlxlVGp5zlM4vZ,KTPM2020,2,2021,100,KTPM2020
60713,D6CBA8B9XPvAibaEXe9w3p4OJXtSaL9uuW+eShrr,CNTT2018,2,2018,90,CNTT2018
61868,6ABC72F1XPvAibaEXe9+m/oQf3Tjz2YG54BF7DRh,PMCL2017,2,2018,80,PMCL2017
101269,1DE3BB6EXPvAibaEXe/W1ZBpbjj8QdCymwa+3ZVI,MTCL2019,2,2021,94,MTCL2019

In [79]:
os.listdir(clean_data_folder)

['12.baoluu.parquet',
 '14.totnghiep.parquet',
 'desktop.ini',
 'diemrl.parquet',
 'diem_Thu.parquet',
 'uit_hocphi_miengiam.parquet']